$(document).ready(function() {
    const memes = ["meme1.jpg", "meme2.jpg", "meme3.jpg", "meme4.jpg", "meme5.jpg", "meme6.jpg", "meme7.jpg", "meme8.jpg", "meme9.jpg", "meme10.jpg", "meme11.jpg", "meme12.jpg", "meme13.jpg", "meme14.jpg"]; 
    const jokes = [
        "Що таке зворотній екзорцизм? Це коли дявол каже священнику вийти з тіла хлопчика.",
        "що робить людожер коли доїдає овоч - виставляє коляску на OLX",
        "У мене в сім'ї всі люблять різні сорти хліба. Бабуся сірий, мама білий, а тато чорний - він любить банани",
        "Заходить бабуся в автобус, а там сидить хлопець. Вона йому каже: - Як ти, милий, схожий на Путіна! Хлопець зрадів: - вау! І чим же схожий - Та сів як падло і нікому місцем не поступаєшся",
        "я працівник поліції -ну та шо -ну і шо-ну ішо - ви дасте сказать.... -ну і шо",
"-Як щодо того, щоб відірватися ввечері - А ти хто такий -Тромб",
"-Вибачте, лікарю, а що ви там мені виписуєте -Свідоцтво про смерть!",
"-Дідусю, а куди ти подів бабусю — Та ми посварилися... — І що — Посолив, поперчив, з’їв...",
"-Лікарю, я боюся ін’єкцій! Можна без уколу -Добре, тоді кремацію.",
        "питають дружину: де ти береш гроші                                                          - вона каже: в тумбачке                                                                                                     - питають: а хто кладе в тумбачку .... гроші                                                                                              -    вона: незнаю😎"
    ];

    $("#getMeme").click(function() {
        const randomIndex = Math.floor(Math.random() * memes.length);
        $("#randomMeme").attr("src", memes[randomIndex]);
    });

    $("#getJoke").click(function() {
        const randomIndex = Math.floor(Math.random() * jokes.length);
        $("#joke").text(jokes[randomIndex]);
    });
});
